In [1]:
import numpy as np 
from pandas import Series,DataFrame
import pandas as pd

In [2]:
ser1 = Series(np.arange(3,16,4),index=list('abcd'))
ser1

a     3
b     7
c    11
d    15
dtype: int32

In [3]:
index1 = list('abcde')
ser2 = ser1.reindex(index1)
ser2

a     3.0
b     7.0
c    11.0
d    15.0
e     NaN
dtype: float64

In [9]:
# fill_value引入缺失值
ser1.reindex(index1,fill_value =0.0)

a     3.0
b     7.0
c    11.0
d    15.0
e     0.0
dtype: float64

In [10]:
ser3 = Series(['14:15:33','14:16:32','14:17:40'],index=range(1,6,2))
ser3

1    14:15:33
3    14:16:32
5    14:17:40
dtype: object

In [16]:
ser3.reindex(range(6),method='bfill')

0    14:15:33
1    14:15:33
2    14:16:32
3    14:16:32
4    14:17:40
5    14:17:40
dtype: object

In [46]:
arr2d = np.arange(1,13).reshape(3,4)
df1 = DataFrame(arr2d,index=list('abc'),columns=['One','Two','Three','Four'])
df1

   One  Two  Three  Four
a    1    2      3     4
b    5    6      7     8
c    9   10     11    12

In [18]:
rowName = list('abcd')
df2 = df1.reindex(rowName)
df2

   One   Two  Three  Four
a  1.0   2.0    3.0   4.0
b  5.0   6.0    7.0   8.0
c  9.0  10.0   11.0  12.0
d  NaN   NaN    NaN   NaN

In [19]:
colName = ['One','Two','Six','Four']
df1.reindex(columns=colName)

   One  Two  Six  Four
a    1    2  NaN     4
b    5    6  NaN     8
c    9   10  NaN    12

In [20]:
df1.reindex(index=rowName,columns=colName)

   One   Two  Six  Four
a  1.0   2.0  NaN   4.0
b  5.0   6.0  NaN   8.0
c  9.0  10.0  NaN  12.0
d  NaN   NaN  NaN   NaN

In [21]:
df1.ix[rowName,colName]

   One   Two  Six  Four
a  1.0   2.0  NaN   4.0
b  5.0   6.0  NaN   8.0
c  9.0  10.0  NaN  12.0
d  NaN   NaN  NaN   NaN

In [22]:
ser4 = Series(np.arange(1,6),index=list('abcde'))
ser4

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [23]:
new_ser = ser4.drop('b')
new_ser

a    1
c    3
d    4
e    5
dtype: int32

In [24]:
ser4.drop(list('ace'))

b    2
d    4
dtype: int32

In [25]:
df1

   One  Two  Three  Four
a    1    2      3     4
b    5    6      7     8
c    9   10     11    12

In [26]:
df1.drop('b')

   One  Two  Three  Four
a    1    2      3     4
c    9   10     11    12

In [28]:
df1.drop('Three',axis=1)

   One  Two  Four
a    1    2     4
b    5    6     8
c    9   10    12

In [29]:
ser4

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [30]:
ser4[[1,3]]

b    2
d    4
dtype: int32

In [31]:
ser4[ser4<3]

a    1
b    2
dtype: int32

In [33]:
ser4['b':'d']  # ser[1:3]   使用标签进行切片运算会包末端的数据

b    2
c    3
d    4
dtype: int32

In [35]:
ser4['b':'d'] = 50
ser4

a     1
b    50
c    50
d    50
e     5
dtype: int32

In [36]:
df1

   One  Two  Three  Four
a    1    2      3     4
b    5    6      7     8
c    9   10     11    12

In [37]:
df1[['Two','Four']]

   Two  Four
a    2     4
b    6     8
c   10    12

In [38]:
df1[:2]

   One  Two  Three  Four
a    1    2      3     4
b    5    6      7     8

In [42]:
df1[(df1['Three'] > 5) & (df1['Three'] < 10)]

   One  Two  Three  Four
b    5    6      7     8

In [43]:
df1 > 5

     One    Two  Three   Four
a  False  False  False  False
b  False   True   True   True
c   True   True   True   True

In [44]:
df1[(df1 > 5) & (df1 < 10)] = 0

In [45]:
df1

   One  Two  Three  Four
a    1    2      3     4
b    5    0      0     0
c    0   10     11    12

In [51]:
arr2d = np.arange(1,21).reshape(5,4)
df1 = DataFrame(arr2d,index=list('abcde'),columns=['One','Two','Three','Four'])
df1

   One  Two  Three  Four
a    1    2      3     4
b    5    6      7     8
c    9   10     11    12
d   13   14     15    16
e   17   18     19    20

In [49]:
df1.ix['b',['Four','One']]

Four    8
One     5
Name: b, dtype: int32

In [58]:
df1.ix['b':'d',[3,0,1]]

   Four  One  Two
b     8    5    6
c    12    9   10
d    16   13   14

In [59]:
df1.ix[df1.Three > 9,:2]

   One  Two
c    9   10
d   13   14
e   17   18

In [61]:
s_one = Series([12,-5.3,47.2,5.3],index=list('abde'))
s_two = Series([-3.3,9.2,-44.4,2,30],index=list('adefg'))
s_one

a    12.0
b    -5.3
d    47.2
e     5.3
dtype: float64

In [62]:
s_two

a    -3.3
d     9.2
e   -44.4
f     2.0
g    30.0
dtype: float64

In [63]:
s_one + s_two

a     8.7
b     NaN
d    56.4
e   -39.1
f     NaN
g     NaN
dtype: float64

In [64]:
df3 = DataFrame(np.arange(1,10).reshape(3,3),columns=list('abc'))
df4 = DataFrame(np.arange(1,13).reshape(3,4),columns=list('abcd'))
df3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [65]:
df4

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [67]:
df3.add(df4,fill_value=10)

    a   b   c     d
0   2   4   6  14.0
1   9  11  13  18.0
2  16  18  20  22.0

In [68]:
sort_ser1 = Series(range(5),index=list('daecb'))
sort_ser1

d    0
a    1
e    2
c    3
b    4
dtype: int32

In [69]:
sort_ser1.sort_index()

a    1
b    4
c    3
d    0
e    2
dtype: int32

In [70]:
sort_df1 = DataFrame(np.arange(1,11).reshape(2,5),index=['Two','One'],
                    columns=list('daecb'))
sort_df1

     d  a  e  c   b
Two  1  2  3  4   5
One  6  7  8  9  10

In [71]:
sort_df1.sort_index()

     d  a  e  c   b
One  6  7  8  9  10
Two  1  2  3  4   5

In [72]:
sort_df1.sort_index(axis=1)

     a   b  c  d  e
Two  2   5  4  1  3
One  7  10  9  6  8

In [73]:
sort_df1.sort_index(axis=1,ascending=False)

     e  d  c   b  a
Two  3  1  4   5  2
One  8  6  9  10  7

In [74]:
sort_ser2 = Series([3,7,np.nan,-5,np.nan,2,-10])
sort_ser2

0     3.0
1     7.0
2     NaN
3    -5.0
4     NaN
5     2.0
6   -10.0
dtype: float64

In [76]:
sort_ser2.sort_values(ascending=False)

1     7.0
0     3.0
5     2.0
3    -5.0
6   -10.0
2     NaN
4     NaN
dtype: float64

In [77]:
sort_df2 = DataFrame({'b':[3,6,-4,7],'a':[0,1,0,1]})
sort_df2

   a  b
0  0  3
1  1  6
2  0 -4
3  1  7

In [79]:
sort_df2.sort_values(by=['a','b'])

   a  b
2  0 -4
0  0  3
1  1  6
3  1  7

In [88]:
sort_ser3 = Series([10,-5,7,5,6,0,5])
sort_ser3

0    10
1    -5
2     7
3     5
4     6
5     0
6     5
dtype: int64

In [89]:
sort_ser3.rank()

0    7.0
1    1.0
2    6.0
3    3.5
4    5.0
5    2.0
6    3.5
dtype: float64

In [90]:
sort_ser3.rank(method='first')

0    7.0
1    1.0
2    6.0
3    3.0
4    5.0
5    2.0
6    4.0
dtype: float64

In [91]:
sort_ser3.rank(ascending=False,method='max')

0    1.0
1    7.0
2    2.0
3    5.0
4    3.0
5    6.0
6    5.0
dtype: float64

In [93]:
sort_df3 = sort_df2
sort_df3['c'] = [-2,5,8,-3.6]
sort_df3

   a  b    c
0  0  3 -2.0
1  1  6  5.0
2  0 -4  8.0
3  1  7 -3.6

In [95]:
sort_df3.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [97]:
rep_ser = Series(range(1,6),index = list('bbaac'))
rep_ser

b    1
b    2
a    3
a    4
c    5
dtype: int32

In [98]:
rep_ser.index.is_unique

False

In [99]:
rep_ser['b']

b    1
b    2
dtype: int32

In [107]:
type(rep_ser['c'])

numpy.int32

In [101]:
rep_df = DataFrame(np.random.randn(4,3),index=list('aabb'))
rep_df

          0         1         2
a -1.930917 -0.844197 -1.021652
a  1.533795  0.112552 -1.280910
b  0.550853 -0.915860 -0.914497
b -0.110575 -1.020295 -0.212795

In [106]:
type(rep_df.ix['b'])

pandas.core.frame.DataFrame

In [103]:
df2

   One   Two  Three  Four
a  1.0   2.0    3.0   4.0
b  5.0   6.0    7.0   8.0
c  9.0  10.0   11.0  12.0
d  NaN   NaN    NaN   NaN

In [105]:
type(df2.ix['b'])

pandas.core.series.Series